const guideData = {
  // SNS投稿（sns）のガイド例
  "sns_16": {
    title: "SNS投稿 No.16 について",
    hint: "「独自入手」というのは、どこに根拠があるのだろうか…。何か怪しい気もする…？",
    message: "情報屋A【ラムダ】の行動が明らかになる可能性があります。"
  },
  "sns_2": {
    title: "SNS投稿 No.2 について",
    hint: "削除された投稿内容はどんな内容だったのだろうか？",
    message: "ぷりんの行動が明らかになる可能性があります。"
  },
  "sns_3": {
    title: "SNS投稿 No.3 について",
    hint: "誰と行ったのだろうか？　SNS上にヒントがあるかもしれない。",
    message: "ぷりんの行動が明らかになる可能性があります。"
  },
  "sns_10": {
    title: "SNS投稿 No.10 について",
    hint: "この画像は大きな伏線になります。アカウントを開示請求して、捜査を進めましょう。",
    message: "この投稿を利用して直接的に事情請求をすることはありません。開示請求を進めましょう。"
  },
  "sns_13": {
    title: "SNS投稿 No.13 について",
    hint: "このコメントは本当なのだろうか。確認手段はあるだろうか？",
    message: "高梨美穂の行動が明らかになる可能性があります。"
  },
  "sns_131": {
    title: "SNS投稿 No.131 について",
    hint: "犯行時刻近くの投稿。事情聴取をしてみても良いかもしれない…。",
    message: "大橋俊の行動が明らかになる可能性があります。"
  },
  "sns_11": {
    title: "SNS投稿 No.11 について",
    hint: "被害者:七瀬朱莉と同じマンションに住んでいるということ。事情聴取してみても良いかもしれない…。",
    message: "高梨美穂のアリバイが詳しくわかる可能性があります。"
  },
  "sns_17": {
    title: "SNS投稿 No.17 について",
    hint: "事件に詳しい情報屋は何か持っているかもしれない。事情聴取してみても良いかもしれない…。",
    message: "情報屋A【ラムダ】の持っている情報が明らかにる可能性があります。"
  },
  "sns_8": {
    title: "SNS投稿 No.8 について",
    hint: "何ができるようになったのだろうか？　証拠を掴めると調査が進むかも？",
    message: "大橋俊の行動が明らかになる可能性があります。"
  },
  "sns_31": {
    title: "SNS投稿 No.31 について",
    hint: "被害者:七瀬朱莉とプライベートの関わりがあった。　事情聴取してみても良いかもしれない…。",
    message: "しょーたろーの行動が明らかになる可能性があります。"
  },
  "sns_18": {
    title: "SNS投稿 No.18 について",
    hint: "情報屋A【ラムダ】の普段の行動とは少し種類が違う。このアパートは近所にあるのだろうか。",
    message: "情報屋A【ラムダ】の行動が明らかになる可能性があります。"
  },
  "sns_21": {
    title: "SNS投稿 No.21 について",
    hint: "被害者のプライベートの投稿。防犯カメラ映像などを用いることで犯人の証拠が得られるかもしれない。",
    message: "被害者に接近していた人物が判明する可能性があります。"
  },
  "sns_39": {
    title: "SNS投稿 No.39 について",
    hint: "住民に対しての情報がとても薄い。関連投稿や、監視カメラ映像などを確認すると証拠が得られるかもしれない。",
    message: "タカギが管理するアパートの住民の情報が判明する可能性があります。"
  },
  "sns_169": {
    title: "SNS投稿 No.169 について",
    hint: "この投稿は本物である可能性があります。この暴露投稿をしたアカウントに開示請求をして、本物か偽物か確かめてみましょう。",
    message: "捜査が進行する可能性があります。"
  },
  // 開示請求（disclosure）のガイド例
  "disclosure_1": {
    title: "管理番号 No.1(ぷりん)の開示結果",
    hint: "ぷりんの削除済みポストを確認した人物がいます。使えるツールを最大限活用して、証拠を掴みましょう。",
    message: "ぷりんの削除済みポストの内容を確定させましょう。"
  },
   "disclosure_2": {
    title: "管理番号 No.2(大橋俊)の開示結果",
    hint: "大橋俊の詳しいプロフィールは入手できていますか？　追跡するような投稿の真偽を確かめるには確実に信頼できる情報源が必要ですね。",
    message: "大橋俊の確実なる事件に関連する情報の証拠を掴みましょう。"
  },
   "disclosure_3": {
    title: "管理番号 No.3(高梨美穂)の開示結果",
    hint: "高梨美穂が過去にあげたポストが事件と関連があるものが存在するか確かめましょう。",
    message: "高梨美穂の事件関連性を確認することで、証拠をつかめるかもしれません。"
  },
   "disclosure_4": {
    title: "管理番号 No.4(情報屋A【ラムダ】)の開示結果",
    hint: "情報屋A【ラムダ】の本名が分かりましたね。高梨美穂に対してアクションを起こし真偽を確かめましょう。",
    message: "高梨美穂の事件の立ち位置や詳しい行動を確認しましょう。"
  },
   "disclosure_5": {
    title: "管理番号 No.5(あかり)の開示結果",
    hint: "プライベートに関わるオンライン仲間がいるらしですね。使えるツールを最大限活用して、人物を特定させましょう。",
    message: "七瀬朱莉と関わりのあった人物に焦点を当てて、情報量を増やしましょう。"
  },
   "disclosure_6": {
    title: "管理番号 No.6(しょーたろー)の開示結果",
    hint: "あかりのオンライン仲間ということはプライベートでの接点があったのかもしれませんね。使えるツールを最大限活用して、彼の詳しい行動を明らかにし情報を得ましょう。",
    message: "溝口翔太郎の行動を確認し、事件の関連性を確かめましょう。"
  },
   "disclosure_7": {
    title: "管理番号 No.7(タカギ)の開示結果",
    hint: "アパートβの詳しい外見や、社宅αとの距離関係からこの人物の犯行は可能か考えましょう。　関連人物を探し、紐付けて事件に関わりのある人物を確定させましょう。",
    message: "地図等の視覚情報を増やすことで事件に関連する人物を探しましょう。"
  },
  "camera_a-410": {
    title: "防犯カメラ a-410 の解析",
    hint: "盗撮された画像をどうにかして見つけられないでしょうか？",
    message: "Sさんが何者かに盗撮されています。"
  },
  "camera_a-704": {
    title: "防犯カメラ a-704 の解析",
    hint: "彼女の発言は本当なのでしょうか？宮本はいつ帰ったのでしょう。",
    message: "真偽を確かめてみましょう。"
  },
  "camera_a-404": {
    title: "防犯カメラ a-410 の解析",
    hint: "この画像は一見何もないように見えますが、実は大きな秘密が隠されています。",
    message: "その秘密は事情聴取で明らかになるでしょう。"
  },
  "disclosure_11": {
    title: "管理番号 No.11（@akaka）の開示結果",
    hint: "この証拠単体では思い通りに進みません。",
    message: "他の証拠と組み合わせてアクションを起こしてみましょう。"
  },
};